Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/3.0.2/samv70/atdf/ATSAMV70N20.atdf
    <module name="SSC" caption="Synchronous Serial Controller" id="6078" version="O">
      <register-group name="SSC">
        <register caption="Control Register" name="SSC_CR" offset="0x0" rw="W" size="4">
          <bitfield caption="Receive Enable" mask="0x00000001" name="RXEN"/>
          <bitfield caption="Receive Disable" mask="0x00000002" name="RXDIS"/>
          <bitfield caption="Transmit Enable" mask="0x00000100" name="TXEN"/>
          <bitfield caption="Transmit Disable" mask="0x00000200" name="TXDIS"/>
          <bitfield caption="Software Reset" mask="0x00008000" name="SWRST"/>
        </register>
        <register caption="Clock Mode Register" name="SSC_CMR" offset="0x4" rw="RW" size="4">
          <bitfield caption="Clock Divider" mask="0x00000FFF" name="DIV"/>
        </register>
        <register caption="Receive Clock Mode Register" name="SSC_RCMR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Receive Clock Selection" mask="0x00000003" name="CKS" values="SSC_RCMR__CKS"/>
          <bitfield caption="Receive Clock Output Mode Selection" mask="0x0000001C" name="CKO" values="SSC_RCMR__CKO"/>
          <bitfield caption="Receive Clock Inversion" mask="0x00000020" name="CKI"/>
          <bitfield caption="Receive Clock Gating Selection" mask="0x000000C0" name="CKG" values="SSC_RCMR__CKG"/>
          <bitfield caption="Receive Start Selection" mask="0x00000F00" name="START" values="SSC_RCMR__START"/>
          <bitfield caption="Receive Stop Selection" mask="0x00001000" name="STOP"/>
          <bitfield caption="Receive Start Delay" mask="0x00FF0000" name="STTDLY"/>
          <bitfield caption="Receive Period Divider Selection" mask="0xFF000000" name="PERIOD"/>
        </register>
        <register caption="Receive Frame Mode Register" name="SSC_RFMR" offset="0x14" rw="RW" size="4">
          <bitfield caption="Data Length" mask="0x0000001F" name="DATLEN"/>
          <bitfield caption="Loop Mode" mask="0x00000020" name="LOOP"/>
          <bitfield caption="Most Significant Bit First" mask="0x00000080" name="MSBF"/>
          <bitfield caption="Data Number per Frame" mask="0x00000F00" name="DATNB"/>
          <bitfield caption="Receive Frame Sync Length" mask="0x000F0000" name="FSLEN"/>
          <bitfield caption="Receive Frame Sync Output Selection" mask="0x00700000" name="FSOS" values="SSC_RFMR__FSOS"/>
          <bitfield caption="Frame Sync Edge Detection" mask="0x01000000" name="FSEDGE" values="SSC_RFMR__FSEDGE"/>
          <bitfield caption="FSLEN Field Extension" mask="0xF0000000" name="FSLEN_EXT"/>
        </register>
        <register caption="Transmit Clock Mode Register" name="SSC_TCMR" offset="0x18" rw="RW" size="4">
          <bitfield caption="Transmit Clock Selection" mask="0x00000003" name="CKS" values="SSC_TCMR__CKS"/>
          <bitfield caption="Transmit Clock Output Mode Selection" mask="0x0000001C" name="CKO" values="SSC_TCMR__CKO"/>
          <bitfield caption="Transmit Clock Inversion" mask="0x00000020" name="CKI"/>
          <bitfield caption="Transmit Clock Gating Selection" mask="0x000000C0" name="CKG" values="SSC_TCMR__CKG"/>
          <bitfield caption="Transmit Start Selection" mask="0x00000F00" name="START" values="SSC_TCMR__START"/>
          <bitfield caption="Transmit Start Delay" mask="0x00FF0000" name="STTDLY"/>
          <bitfield caption="Transmit Period Divider Selection" mask="0xFF000000" name="PERIOD"/>
        </register>
        <register caption="Transmit Frame Mode Register" name="SSC_TFMR" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Data Length" mask="0x0000001F" name="DATLEN"/>
          <bitfield caption="Data Default Value" mask="0x00000020" name="DATDEF"/>
          <bitfield caption="Most Significant Bit First" mask="0x00000080" name="MSBF"/>
          <bitfield caption="Data Number per Frame" mask="0x00000F00" name="DATNB"/>
          <bitfield caption="Transmit Frame Sync Length" mask="0x000F0000" name="FSLEN"/>
          <bitfield caption="Transmit Frame Sync Output Selection" mask="0x00700000" name="FSOS" values="SSC_TFMR__FSOS"/>
          <bitfield caption="Frame Sync Data Enable" mask="0x00800000" name="FSDEN"/>
          <bitfield caption="Frame Sync Edge Detection" mask="0x01000000" name="FSEDGE" values="SSC_TFMR__FSEDGE"/>
          <bitfield caption="FSLEN Field Extension" mask="0xF0000000" name="FSLEN_EXT"/>
        </register>
        <register caption="Receive Holding Register" name="SSC_RHR" offset="0x20" rw="R" size="4">
          <bitfield caption="Receive Data" mask="0xFFFFFFFF" name="RDAT"/>
        </register>
        <register caption="Transmit Holding Register" name="SSC_THR" offset="0x24" rw="W" size="4">
          <bitfield caption="Transmit Data" mask="0xFFFFFFFF" name="TDAT"/>
        </register>
        <register caption="Receive Sync. Holding Register" name="SSC_RSHR" offset="0x30" rw="R" size="4">
          <bitfield caption="Receive Synchronization Data" mask="0x0000FFFF" name="RSDAT"/>
        </register>
        <register caption="Transmit Sync. Holding Register" name="SSC_TSHR" offset="0x34" rw="RW" size="4">
          <bitfield caption="Transmit Synchronization Data" mask="0x0000FFFF" name="TSDAT"/>
        </register>
        <register caption="Receive Compare 0 Register" name="SSC_RC0R" offset="0x38" rw="RW" size="4">
          <bitfield caption="Receive Compare Data 0" mask="0x0000FFFF" name="CP0"/>
        </register>
        <register caption="Receive Compare 1 Register" name="SSC_RC1R" offset="0x3C" rw="RW" size="4">
          <bitfield caption="Receive Compare Data 1" mask="0x0000FFFF" name="CP1"/>
        </register>
        <register caption="Status Register" name="SSC_SR" offset="0x40" rw="R" size="4">
          <bitfield caption="Transmit Ready" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="Transmit Empty" mask="0x00000002" name="TXEMPTY"/>
          <bitfield caption="Receive Ready" mask="0x00000010" name="RXRDY"/>
          <bitfield caption="Receive Overrun" mask="0x00000020" name="OVRUN"/>
          <bitfield caption="Compare 0" mask="0x00000100" name="CP0"/>
          <bitfield caption="Compare 1" mask="0x00000200" name="CP1"/>
          <bitfield caption="Transmit Sync" mask="0x00000400" name="TXSYN"/>
          <bitfield caption="Receive Sync" mask="0x00000800" name="RXSYN"/>
          <bitfield caption="Transmit Enable" mask="0x00010000" name="TXEN"/>
          <bitfield caption="Receive Enable" mask="0x00020000" name="RXEN"/>
        </register>
        <register caption="Interrupt Enable Register" name="SSC_IER" offset="0x44" rw="W" size="4" atomic-op="set:SSC_IMR">
          <bitfield caption="Transmit Ready Interrupt Enable" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="Transmit Empty Interrupt Enable" mask="0x00000002" name="TXEMPTY"/>
          <bitfield caption="Receive Ready Interrupt Enable" mask="0x00000010" name="RXRDY"/>
          <bitfield caption="Receive Overrun Interrupt Enable" mask="0x00000020" name="OVRUN"/>
          <bitfield caption="Compare 0 Interrupt Enable" mask="0x00000100" name="CP0"/>
          <bitfield caption="Compare 1 Interrupt Enable" mask="0x00000200" name="CP1"/>
          <bitfield caption="Tx Sync Interrupt Enable" mask="0x00000400" name="TXSYN"/>
          <bitfield caption="Rx Sync Interrupt Enable" mask="0x00000800" name="RXSYN"/>
        </register>
        <register caption="Interrupt Disable Register" name="SSC_IDR" offset="0x48" rw="W" size="4" atomic-op="clear:SSC_IMR">
          <bitfield caption="Transmit Ready Interrupt Disable" mask="0x00000001" name="TXRDY"/>
          <bitfield caption="Transmit Empty Interrupt Disable" mask="0x00000002" name="TXEMPTY"/>
          <bitfield caption="Receive Ready Interrupt Disable" mask="0x00000010" name="RXRDY"/>
          <bitfield caption="Receive Overrun Interrupt Disable" mask="0x00000020" name="OVRUN"/>
          <bitfield caption="Compare 0 Interrupt Disable" mask="0x00000100" name="CP0"/>
          <bitfield caption="Compare 1 Interrupt Disable" mask="0x00000200" name="CP1"/>
          <bitfield caption="Tx Sync Interrupt Enable" mask="0x00000400" name="TXSYN"/>
          <bitfield caption="Rx Sync Interrupt Enable" mask="0x00000800" name="RXSYN"/>
        </register>
