Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/3.0.2/samv70/atdf/ATSAMV70N20.atdf
        <register caption="Lock Bits Word 1" name="LOCKBIT_WORD1" offset="0x4" rw="RW" size="4">
          <bitfield caption="Lock Region 32" mask="0x00000001" name="LOCK_REGION_32"/>
          <bitfield caption="Lock Region 33" mask="0x00000002" name="LOCK_REGION_33"/>
          <bitfield caption="Lock Region 34" mask="0x00000004" name="LOCK_REGION_34"/>
          <bitfield caption="Lock Region 35" mask="0x00000008" name="LOCK_REGION_35"/>
          <bitfield caption="Lock Region 36" mask="0x00000010" name="LOCK_REGION_36"/>
          <bitfield caption="Lock Region 37" mask="0x00000020" name="LOCK_REGION_37"/>
          <bitfield caption="Lock Region 38" mask="0x00000040" name="LOCK_REGION_38"/>
          <bitfield caption="Lock Region 39" mask="0x00000080" name="LOCK_REGION_39"/>
          <bitfield caption="Lock Region 40" mask="0x00000100" name="LOCK_REGION_40"/>
          <bitfield caption="Lock Region 41" mask="0x00000200" name="LOCK_REGION_41"/>
          <bitfield caption="Lock Region 42" mask="0x00000400" name="LOCK_REGION_42"/>
          <bitfield caption="Lock Region 43" mask="0x00000800" name="LOCK_REGION_43"/>
          <bitfield caption="Lock Region 44" mask="0x00001000" name="LOCK_REGION_44"/>
          <bitfield caption="Lock Region 45" mask="0x00002000" name="LOCK_REGION_45"/>
          <bitfield caption="Lock Region 46" mask="0x00004000" name="LOCK_REGION_46"/>
          <bitfield caption="Lock Region 47" mask="0x00008000" name="LOCK_REGION_47"/>
          <bitfield caption="Lock Region 48" mask="0x00010000" name="LOCK_REGION_48"/>
          <bitfield caption="Lock Region 49" mask="0x00020000" name="LOCK_REGION_49"/>
          <bitfield caption="Lock Region 50" mask="0x00040000" name="LOCK_REGION_50"/>
          <bitfield caption="Lock Region 51" mask="0x00080000" name="LOCK_REGION_51"/>
          <bitfield caption="Lock Region 52" mask="0x00100000" name="LOCK_REGION_52"/>
          <bitfield caption="Lock Region 53" mask="0x00200000" name="LOCK_REGION_53"/>
          <bitfield caption="Lock Region 54" mask="0x00400000" name="LOCK_REGION_54"/>
          <bitfield caption="Lock Region 55" mask="0x00800000" name="LOCK_REGION_55"/>
          <bitfield caption="Lock Region 56" mask="0x01000000" name="LOCK_REGION_56"/>
          <bitfield caption="Lock Region 57" mask="0x02000000" name="LOCK_REGION_57"/>
          <bitfield caption="Lock Region 58" mask="0x04000000" name="LOCK_REGION_58"/>
          <bitfield caption="Lock Region 59" mask="0x08000000" name="LOCK_REGION_59"/>
          <bitfield caption="Lock Region 60" mask="0x10000000" name="LOCK_REGION_60"/>
          <bitfield caption="Lock Region 61" mask="0x20000000" name="LOCK_REGION_61"/>
          <bitfield caption="Lock Region 62" mask="0x40000000" name="LOCK_REGION_62"/>
          <bitfield caption="Lock Region 63" mask="0x80000000" name="LOCK_REGION_63"/>
        </register>
      </register-group>
    </module>
    <module name="DACC" caption="Digital-to-Analog Converter Controller" id="11246" version="D">
      <register-group name="DACC">
        <register caption="Control Register" name="DACC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="DACC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Max Speed Mode for Channel 0" mask="0x00000001" name="MAXS0" values="DACC_MR__MAXS0"/>
          <bitfield caption="Max Speed Mode for Channel 1" mask="0x00000002" name="MAXS1" values="DACC_MR__MAXS1"/>
          <bitfield caption="Word Transfer Mode" mask="0x00000010" name="WORD" values="DACC_MR__WORD"/>
          <bitfield caption="Must always be written to 0." mask="0x00000020" name="ZERO"/>
          <bitfield caption="Differential Mode" mask="0x00800000" name="DIFF" values="DACC_MR__DIFF"/>
          <bitfield caption="Peripheral Clock to DAC Clock Ratio" mask="0x0F000000" name="PRESCALER"/>
        </register>
        <register caption="Trigger Register" name="DACC_TRIGR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Trigger Enable of Channel 0" mask="0x00000001" name="TRGEN0" values="DACC_TRIGR__TRGEN0"/>
          <bitfield caption="Trigger Enable of Channel 1" mask="0x00000002" name="TRGEN1" values="DACC_TRIGR__TRGEN1"/>
          <bitfield caption="Trigger Selection of Channel 0" mask="0x00000070" name="TRGSEL0" values="DACC_TRIGR__TRGSEL0"/>
          <bitfield caption="Trigger Selection of Channel 1" mask="0x00000700" name="TRGSEL1" values="DACC_TRIGR__TRGSEL1"/>
          <bitfield caption="Over Sampling Ratio of Channel 0" mask="0x00070000" name="OSR0" values="DACC_TRIGR__OSR0"/>
          <bitfield caption="Over Sampling Ratio of Channel 1" mask="0x00700000" name="OSR1" values="DACC_TRIGR__OSR1"/>
        </register>
        <register caption="Channel Enable Register" name="DACC_CHER" offset="0x10" rw="W" size="4" atomic-op="set:DACC_CHSR">
          <bitfield caption="Channel 0 Enable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Enable" mask="0x00000002" name="CH1"/>
        </register>
        <register caption="Channel Disable Register" name="DACC_CHDR" offset="0x14" rw="W" size="4" atomic-op="clear:DACC_CHSR">
          <bitfield caption="Channel 0 Disable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Disable" mask="0x00000002" name="CH1"/>
        </register>
        <register caption="Channel Status Register" name="DACC_CHSR" offset="0x18" rw="R" size="4">
          <bitfield caption="Channel 0 Status" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Status" mask="0x00000002" name="CH1"/>
          <bitfield caption="DAC Ready Flag" mask="0x00000100" name="DACRDY0"/>
          <bitfield caption="DAC Ready Flag" mask="0x00000200" name="DACRDY1"/>
        </register>
        <register caption="Conversion Data Register 0" name="DACC_CDR" offset="0x1C" rw="W" size="4" count="2">
          <bitfield caption="Data to Convert for channel 0" mask="0x0000FFFF" name="DATA0"/>
          <bitfield caption="Data to Convert for channel 1" mask="0xFFFF0000" name="DATA1"/>
        </register>
        <register caption="Interrupt Enable Register" name="DACC_IER" offset="0x24" rw="W" size="4" atomic-op="set:DACC_IMR">
          <bitfield caption="Transmit Ready Interrupt Enable of channel 0" mask="0x00000001" name="TXRDY0"/>
          <bitfield caption="Transmit Ready Interrupt Enable of channel 1" mask="0x00000002" name="TXRDY1"/>
          <bitfield caption="End of Conversion Interrupt Enable of channel 0" mask="0x00000010" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Enable of channel 1" mask="0x00000020" name="EOC1"/>
        </register>
        <register caption="Interrupt Disable Register" name="DACC_IDR" offset="0x28" rw="W" size="4" atomic-op="clear:DACC_IMR">
          <bitfield caption="Transmit Ready Interrupt Disable of channel 0" mask="0x00000001" name="TXRDY0"/>
          <bitfield caption="Transmit Ready Interrupt Disable of channel 1" mask="0x00000002" name="TXRDY1"/>
          <bitfield caption="End of Conversion Interrupt Disable of channel 0" mask="0x00000010" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Disable of channel 1" mask="0x00000020" name="EOC1"/>
        </register>
