Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/3.0.2/samv70/atdf/ATSAMV70N20.atdf
            <value-group name="VCATCH">
                <value value="0" name="VALUE_0" caption="No Vector catch triggered"/>
                <value value="1" name="VALUE_1" caption="Vector catch triggered"/>
            </value-group>
            <value-group name="EXTERNAL">
                <value value="0" name="VALUE_0" caption="No EDBGRQ debug event"/>
                <value value="1" name="VALUE_1" caption="EDBGRQ debug event"/>
            </value-group>
            <value-group name="LOCLOU">
                <value value="0" name="LEVEL_1" caption="if neither instruction nor data cache is implemented"/>
                <value value="1" name="LEVEL_2" caption="if either cache is implemented"/>
            </value-group>
            <value-group name="CSSELR_IND">
                <value value="0" name="DATA" caption="Data cache"/>
                <value value="1" name="INSTRUCTION" caption="Instruction cache"/>
            </value-group>
        </module>
    <module name="SysTick" caption="System timer">
            <register-group name="SysTick" caption="System timer Registers">
                <register offset="0x00000000" size="4" name="CSR" initval="0x4" caption="Control and Status Register">
                    <bitfield mask="0x00000001" name="ENABLE" values="ENABLE" caption="Enables the counter"/>
                    <bitfield mask="0x00000002" name="TICKINT" values="TICKINT" caption="Enables SysTick exception request"/>
                    <bitfield mask="0x00000004" name="CLKSOURCE" values="CLKSOURCE" caption="Indicates the clock source"/>
                    <bitfield mask="0x00010000" name="COUNTFLAG" caption="Returns 1 if timer counted to 0 since last time this was read"/>
                </register>
                <register offset="0x00000004" size="4" name="RVR" initval="0" caption="Reload Value Register">
                    <bitfield mask="0x00ffffff" name="RELOAD" caption="Value to load into the SysTick Current Value Register when the counter reaches 0"/>
                </register>
                <register offset="0x00000008" size="4" name="CVR" initval="0" caption="Current Value Register">
                    <bitfield mask="0x00ffffff" name="CURRENT" caption="Current value at the time the register is accessed"/>
                </register>
                <register offset="0x0000000c" size="4" name="CALIB" initval="0" rw="R" caption="Calibration Value Register">
                    <bitfield mask="0x00ffffff" name="TENMS" caption="Reload value to use for 10ms timing"/>
                    <bitfield mask="0x40000000" name="SKEW" values="SKEW" caption="Indicates whether the TENMS value is exact"/>
                    <bitfield mask="0x80000000" name="NOREF" values="NOREF" caption="Indicates whether the device provides a reference clock to the processor"/>
                </register>
            </register-group>
            <value-group name="ENABLE">
                <value value="0" name="VALUE_0" caption="counter disabled"/>
                <value value="1" name="VALUE_1" caption="counter enabled"/>
            </value-group>
            <value-group name="TICKINT">
                <value value="0" name="VALUE_0" caption="counting down to 0 does not assert the SysTick exception request"/>
                <value value="1" name="VALUE_1" caption="counting down to 0 asserts the SysTick exception request"/>
            </value-group>
            <value-group name="CLKSOURCE">
                <value value="0" name="VALUE_0" caption="external clock"/>
                <value value="1" name="VALUE_1" caption="processor clock"/>
            </value-group>
            <value-group name="SKEW">
                <value value="0" name="VALUE_0" caption="10ms calibration value is exact"/>
                <value value="1" name="VALUE_1" caption="10ms calibration value is inexact, because of the clock frequency"/>
            </value-group>
            <value-group name="NOREF">
                <value value="0" name="VALUE_0" caption="The reference clock is provided"/>
                <value value="1" name="VALUE_1" caption="The reference clock is not provided"/>
            </value-group>
        </module>
    <module name="NVIC" caption="Nested Vectored Interrupt Controller">
            <register-group name="NVIC" caption="Nested Vectored Interrupt Controller">
                <register offset="0x00000000" size="4" name="ISER" count="8" initval="0" caption="Interrupt Set Enable Register n">
                    <bitfield mask="0xffffffff" name="SETENA" caption="Interrupt set enable bits"/>
                </register>
                <register offset="0x00000080" size="4" name="ICER" count="8" initval="0" caption="Interrupt Clear Enable Register n">
                    <bitfield mask="0xffffffff" name="CLRENA" caption="Interrupt clear-enable bits"/>
                </register>
                <register offset="0x00000100" size="4" name="ISPR" count="8" initval="0" caption="Interrupt Set Pending Register n">
                    <bitfield mask="0xffffffff" name="SETPEND" caption="Interrupt set-pending bits"/>
                </register>
                <register offset="0x00000180" size="4" name="ICPR" count="8" initval="0" caption="Interrupt Clear Pending Register n">
                    <bitfield mask="0xffffffff" name="CLRPEND" caption="Interrupt clear-pending bits"/>
                </register>
                <register offset="0x00000200" size="4" name="IABR" count="8" initval="0" caption="Interrupt Active bit Register n">
                    <bitfield mask="0xffffffff" name="ACTIVE" caption="Interrupt active flags"/>
                </register>
                <register offset="0x00000300" size="1" name="IP" count="240" initval="0" caption="Interrupt Priority Register (8Bit wide) n">
                    <bitfield mask="0x000000ff" name="PRI0" caption="Priority of interrupt 0"/>
                </register>
                <register offset="0x00000e00" size="4" name="STIR" initval="0" rw="W" caption="Software Trigger Interrupt Register">
                    <bitfield mask="0x000001ff" name="INTID" caption="Interrupt ID of the interrupt to trigger, in the range 0-239. For example, a value of 0x03 specifies interrupt IRQ3."/>
                </register>
            </register-group>
        </module>
    <module name="MPU" caption="Memory Protection Unit">
            <register-group name="MPU" caption="Memory Protection Unit Registers">
                <register offset="0x00000000" size="4" name="TYPE" initval="0x00001000" caption="MPU Type Register">
                    <bitfield mask="0x00000001" name="SEPARATE" caption="Indicates support for unified or separate instruction and date memory maps."/>
                    <bitfield mask="0x0000FF00" name="DREGION" caption="Indicates the number of supported MPU instruction regions."/>
                    <bitfield mask="0x00FF0000" name="IREGION" caption="Indicates the number of supported MPU data regions."/>
                </register>
                <register offset="0x00000004" size="4" name="CTRL" initval="0x00000000" caption="MPU Control Register">
                    <bitfield mask="0x00000001" name="ENABLE" caption="Enables the MPU"/>
                    <bitfield mask="0x00000002" name="HFNMIENA" caption="Enables the operation of MPU during hard fault, NMI, and FAULTMASK handlers."/>
                    <bitfield mask="0x00000004" name="PRIVDEFENA" caption="Enables privileged software access to the default memory map."/>
                </register>
